SwiperWitty/Core-Caven32/DIY-Demo/OPEN_Nc_Power/User/.pack/ArteryTek/AT32F415_DFP.2.0.7/ArteryTek.AT32F415_DFP.pdsc
<?xml version="1.0" encoding="UTF-8"?>
<package schemaVersion="1.2" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>ArteryTek</vendor>
  <url></url>
  <name>AT32F415_DFP</name>
  <description>ArteryTek AT32F415 Series Device Support,Drivers</description>
  <releases>
    <release version="2.0.7" date="2022-08-23">
      Update firmware library.
    </release>
    <release version="2.0.6" date="2022-06-29">
      Update firmware library.
    </release>
    <release version="2.0.5" date="2022-05-20">
      Update firmware library.
    </release>
    <release version="2.0.4" date="2022-04-02">
      Update firmware library.
    </release>
    <release version="2.0.3" date="2022-02-11">
      Update firmware library.
    </release>
    <release version="2.0.2" date="2021-12-31">
      Update firmware library.
    </release>
    <release version="2.0.1" date="2021-12-17">
      Update firmware library.
    </release>
    <release version="2.0.0" date="2021-11-26">
      First Release version of AT32F415 Device Family Pack.
    </release>
  </releases>
  <keywords>
    <!-- keywords for indexing -->
    <keyword>ArteryTek</keyword>
    <keyword>AT32F415</keyword>
    <keyword>AT32F4</keyword>
  </keywords>

  <devices>
    <!-- ******************************  Cortex-M4  ********************** -->
    <family Dfamily="AT32F41x Series" Dvendor="ArteryTek:143">
      <!--book name="Device/ARM/Documents/??_dgug.pdf"       title="?? Device Generic Users Guide"/-->
    <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="1" Dmpu="1" Dtz="NO_TZ" Dendian="Little-endian" />
    <compile header="Device/Include/at32f415.h"/>

      <description>
AT32F4 is a new 32-bit high performance, low power consumption universal microcontroller family powered by the ARM Cortex-M4 RISC core,which targeted at various MCU application areas.
AT32F4 family integrates features to simplify system design and provide customers wide range of comprehensive and superior cost effective MCU portfolios with proven technology and great innovation.
      </description>    

      <!-- ************************  Subfamily 'AT32F415'  **************************** -->
      <subFamily DsubFamily="AT32F415">
      <processor  Dfpu="0" Dclock="150000000"/>
      <debug svd="SVD/AT32F415xx_v2.svd"/>
      <description>
AT32F415 - ARM Cortex-M4 Core
  Frequency up to 150 MHz
  Single-cycle multiplier and hardware divider
  NVIC support 16 internal, 55 external interrupts, each has 16 priority levels

Memories
  Flash size from 64KB up to 256KB
  SRAM size up to 32KB

Low power management
  Power saving mode: sleep,deep-sleep and standby mode

Advanced analog peripherals
  Up to 1 x 12bit ADC

Integrated peripherals interface
  Up to 5 x USART/UART/Irda/LIN/ISO7816
  Up to 4 x SPI
  Up to 2 x I2C

On-chip resources
  Up to 1 x 16 bit Advanced Timer, 1 x SysTick Timer, 5 x 16 bit GPTM, 2 x 32 bit GPTM, 2 x WDT, 1 x ERTC
  5-chs DMA support: Timers, ADC, SPIs, I2Cs, USARTs
  System supervisor and reset: POR,PDR,LVD
  80% GPIO available
  32-bit CRC, 96-bit unique ID
  On-chip clock: HICK (8MHz), LICK (40KHz)
      </description>

      <feature type="WDT"           n="2"/>
      <feature type="RTC"           n="32768"/>
      <feature type="ADC"           n="1"       m="12"/>
      <feature type="Temp"          n="-40"     m="85"/>
      <feature type="VCC"           n="2.60"    m="3.60"/>

        <!-- *************************  Device 'AT32F415K8U7-4'  ***************************** -->
        <device Dname="-AT32F415K8U7-4">
          <compile header="Device/Include/at32f415.h"  define="AT32F415K8U7_4"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x10000"     startup="1"        default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x8000"      init   ="0"        default="1"/>
          <algorithm name="Flash/AT32F415_64.FLM"                     start="0x08000000" size="0x10000"   default="1"/>
          <algorithm name="Flash/AT32F415_BOOTMEM_AP.FLM"             start="0x1FFFAC00" size="0x04800"   default="0"/>
          <algorithm name="Flash/AT32F415_USD.FLM"                    start="0x1FFFF800" size="0x00040"   default="0"/>
        </device>

        <!-- *************************  Device 'AT32F415KBU7-4'  ***************************** -->
        <device Dname="-AT32F415KBU7-4">
          <compile header="Device/Include/at32f415.h"  define="AT32F415KBU7_4"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x20000"     startup="1"        default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x8000"      init   ="0"        default="1"/>
          <algorithm name="Flash/AT32F415_128.FLM"                    start="0x08000000" size="0x20000"   default="1"/>
          <algorithm name="Flash/AT32F415_BOOTMEM_AP.FLM"             start="0x1FFFAC00" size="0x04800"   default="0"/>
          <algorithm name="Flash/AT32F415_USD.FLM"                    start="0x1FFFF800" size="0x00040"   default="0"/>
        </device>

        <!-- *************************  Device 'AT32F415KCU7-4'  ***************************** -->
        <device Dname="-AT32F415KCU7-4">
          <compile header="Device/Include/at32f415.h"  define="AT32F415KCU7_4"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x40000"     startup="1"        default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x8000"      init   ="0"        default="1"/>
          <algorithm name="Flash/AT32F415_256.FLM"                    start="0x08000000" size="0x40000"   default="1"/>
          <algorithm name="Flash/AT32F415_BOOTMEM_AP.FLM"             start="0x1FFFAC00" size="0x04800"   default="0"/>
          <algorithm name="Flash/AT32F415_USD.FLM"                    start="0x1FFFF800" size="0x00040"   default="0"/>
        </device>

        <!-- *************************  Device 'AT32F415C8T7'  ***************************** -->
        <device Dname="-AT32F415C8T7">
          <compile header="Device/Include/at32f415.h"  define="AT32F415C8T7"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x10000"     startup="1"        default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x8000"      init   ="0"        default="1"/>
          <algorithm name="Flash/AT32F415_64.FLM"                     start="0x08000000" size="0x10000"   default="1"/>
          <algorithm name="Flash/AT32F415_BOOTMEM_AP.FLM"             start="0x1FFFAC00" size="0x04800"   default="0"/>
          <algorithm name="Flash/AT32F415_USD.FLM"                    start="0x1FFFF800" size="0x00040"   default="0"/>
        </device>

        <!-- *************************  Device 'AT32F415CBT7'  ***************************** -->
        <device Dname="-AT32F415CBT7">
          <compile header="Device/Include/at32f415.h"  define="AT32F415CBT7"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x20000"     startup="1"        default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x8000"      init   ="0"        default="1"/>
          <algorithm name="Flash/AT32F415_128.FLM"                    start="0x08000000" size="0x20000"   default="1"/>
          <algorithm name="Flash/AT32F415_BOOTMEM_AP.FLM"             start="0x1FFFAC00" size="0x04800"   default="0"/>
          <algorithm name="Flash/AT32F415_USD.FLM"                    start="0x1FFFF800" size="0x00040"   default="0"/>
        </device>

        <!-- *************************  Device 'AT32F415CCT7'  ***************************** -->
        <device Dname="-AT32F415CCT7">
          <compile header="Device/Include/at32f415.h"  define="AT32F415CCT7"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x40000"     startup="1"        default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x8000"      init   ="0"        default="1"/>
          <algorithm name="Flash/AT32F415_256.FLM"                    start="0x08000000" size="0x40000"   default="1"/>
          <algorithm name="Flash/AT32F415_BOOTMEM_AP.FLM"             start="0x1FFFAC00" size="0x04800"   default="0"/>
          <algorithm name="Flash/AT32F415_USD.FLM"                    start="0x1FFFF800" size="0x00040"   default="0"/>
        </device>
