SwiperWitty/Core-Caven32/DIY-Demo/OPEN_Nc_Power/User/.pack/ArteryTek/AT32F415_DFP.2.0.7/ArteryTek.AT32F415_DFP.pdsc
        <!-- *************************  Device 'AT32F415CBU7'  ***************************** -->
        <device Dname="AT32F415CBU7">
          <compile header="Device/Include/at32f415.h"  define="AT32F415CBU7"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x20000"     startup="1"   default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x8000"      init   ="0"   default="1"/>
          <algorithm name="Flash/AT32F415_128.FLM"                    start="0x08000000" size="0x20000"   default="1"/>
          <algorithm name="Flash/AT32F415_BOOTMEM_AP.FLM"             start="0x1FFFAC00" size="0x04800"   default="0"/>
          <algorithm name="Flash/AT32F415_USD.FLM"                    start="0x1FFFF800" size="0x00040"   default="0"/>
        </device>

        <!-- *************************  Device 'AT32F415CCU7'  ***************************** -->
        <device Dname="-AT32F415CCU7">
          <compile header="Device/Include/at32f415.h"  define="AT32F415CCU7"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x40000"     startup="1"   default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x8000"      init   ="0"   default="1"/>
          <algorithm name="Flash/AT32F415_256.FLM"                    start="0x08000000" size="0x40000"   default="1"/>
          <algorithm name="Flash/AT32F415_BOOTMEM_AP.FLM"             start="0x1FFFAC00" size="0x04800"   default="0"/>
          <algorithm name="Flash/AT32F415_USD.FLM"                    start="0x1FFFF800" size="0x00040"   default="0"/>
        </device>

        <!-- *************************  Device 'AT32F415R8T7'  ***************************** -->
        <device Dname="-AT32F415R8T7">
          <compile header="Device/Include/at32f415.h"  define="AT32F415R8T7"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x10000"     startup="1"        default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x8000"      init   ="0"        default="1"/>
          <algorithm name="Flash/AT32F415_64.FLM"                     start="0x08000000" size="0x10000"   default="1"/>
          <algorithm name="Flash/AT32F415_BOOTMEM_AP.FLM"             start="0x1FFFAC00" size="0x04800"   default="0"/>
          <algorithm name="Flash/AT32F415_USD.FLM"                    start="0x1FFFF800" size="0x00040"   default="0"/>
        </device>

        <!-- *************************  Device 'AT32F415RBT7'  ***************************** -->
        <device Dname="-AT32F415RBT7">
          <compile header="Device/Include/at32f415.h"  define="AT32F415RBT7"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x20000"     startup="1"        default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x8000"      init   ="0"        default="1"/>
          <algorithm name="Flash/AT32F415_128.FLM"                    start="0x08000000" size="0x20000"   default="1"/>
          <algorithm name="Flash/AT32F415_BOOTMEM_AP.FLM"             start="0x1FFFAC00" size="0x04800"   default="0"/>
          <algorithm name="Flash/AT32F415_USD.FLM"                    start="0x1FFFF800" size="0x00040"   default="0"/>
        </device>

        <!-- *************************  Device 'AT32F415RCT7'  ***************************** -->
        <device Dname="-AT32F415RCT7">
          <compile header="Device/Include/at32f415.h"  define="AT32F415RCT7"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x40000"     startup="1"        default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x8000"      init   ="0"        default="1"/>
          <algorithm name="Flash/AT32F415_256.FLM"                    start="0x08000000" size="0x40000"   default="1"/>
          <algorithm name="Flash/AT32F415_BOOTMEM_AP.FLM"             start="0x1FFFAC00" size="0x04800"   default="0"/>
          <algorithm name="Flash/AT32F415_USD.FLM"                    start="0x1FFFF800" size="0x00040"   default="0"/>
        </device>

        <!-- *************************  Device 'AT32F415R8T7-7'  ***************************** -->
        <device Dname="-AT32F415R8T7-7">
          <compile header="Device/Include/at32f415.h"  define="AT32F415R8T7_7"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x10000"     startup="1"        default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x8000"      init   ="0"        default="1"/>
          <algorithm name="Flash/AT32F415_64.FLM"                     start="0x08000000" size="0x10000"   default="1"/>
          <algorithm name="Flash/AT32F415_BOOTMEM_AP.FLM"             start="0x1FFFAC00" size="0x04800"   default="0"/>
          <algorithm name="Flash/AT32F415_USD.FLM"                    start="0x1FFFF800" size="0x00040"   default="0"/>
        </device>

        <!-- *************************  Device 'AT32F415RBT7-7'  ***************************** -->
        <device Dname="-AT32F415RBT7-7">
          <compile header="Device/Include/at32f415.h"  define="AT32F415RBT7_7"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x20000"     startup="1"        default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x8000"      init   ="0"        default="1"/>
          <algorithm name="Flash/AT32F415_128.FLM"                    start="0x08000000" size="0x20000"   default="1"/>
          <algorithm name="Flash/AT32F415_BOOTMEM_AP.FLM"             start="0x1FFFAC00" size="0x04800"   default="0"/>
          <algorithm name="Flash/AT32F415_USD.FLM"                    start="0x1FFFF800" size="0x00040"   default="0"/>
        </device>

        <!-- *************************  Device 'AT32F415RCT7-7'  ***************************** -->
        <device Dname="-AT32F415RCT7-7">
          <compile header="Device/Include/at32f415.h"  define="AT32F415RCT7_7"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x40000"     startup="1"        default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x8000"      init   ="0"        default="1"/>
          <algorithm name="Flash/AT32F415_256.FLM"                    start="0x08000000" size="0x40000"   default="1"/>
          <algorithm name="Flash/AT32F415_BOOTMEM_AP.FLM"             start="0x1FFFAC00" size="0x04800"   default="0"/>
          <algorithm name="Flash/AT32F415_USD.FLM"                    start="0x1FFFF800" size="0x00040"   default="0"/>
        </device>

     </subFamily>

    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>

    <!-- Device Conditions -->
    <condition id="AT32F415xx">
      <description>ArteryTek AT32F415 Devices</description>
      <require Dvendor="ArteryTek:143" Dname="-AT32F415[CKR]*"/>
      <require Cclass="Device" Cgroup="Startup" />
    </condition>

    <condition id="AT32F415">
      <description>ArteryTek AT32F415 Devices</description>
      <accept condition="AT32F415xx"/>
    </condition>

    <!-- Series id Conditions -->
    <condition id="AT32F415xx ARMCC">
      <description>ArteryTek AT32F415xx Series devices</description>
      <require Dvendor="ArteryTek:143" Dname="-AT32F415[CKR]*"/>
      <require condition="Compiler ARMCC"/>
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="AT32F415 CMSIS">
      <description>ArteryTek AT32F415 Devices and CMSIS-CORE</description>
      <require condition="AT32F415"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="at32f415_conf"/>    
      <require Cclass="Device" Cgroup="at32f415_firmware_library" Csub="crm"/>           
    </condition>

    <!-- AT32F415 STDPERIPHERALS CRM Conditions -->
    <condition id="AT32F415 STDPERIPHERALS CRM">
      <description>ArteryTek AT32F415 Standard Peripherals Drivers with CRM</description>
      <require condition="AT32F415 CMSIS"/>
      <require Cclass="Device" Cgroup="at32f415_firmware_library" Csub="crm"/>
    </condition>

     <!-- AT32F415 STDPERIPHERALS MISC Conditions -->
    <condition id="AT32F415 STDPERIPHERALS MISC">
      <description>ArteryTek  AT32F415 Standard Peripherals Drivers with MISC</description>
      <require condition="AT32F415 CMSIS"/>
      <require Cclass="Device" Cgroup="at32f415_firmware_library" Csub="misc"/>
    </condition>

