SwiperWitty/Core-Caven32/DIY-Demo/OPEN_Nc_Power/User/.pack/ArteryTek/AT32F415_DFP.2.0.7/ArteryTek.AT32F415_DFP.pdsc
    <component Cclass="Device" Cgroup="at32f415_firmware_library" Csub="pwc" Cversion="2.0.0" condition="AT32F415 STDPERIPHERALS CRM">
      <description>Power Control Unit(PWC) driver for AT32F415 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_PWC
        </RTE_Components_h>
        <files>
          <!-- PWC file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f415_pwc.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/at32f415_pwc.c" attr="config" version="2.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="at32f415_firmware_library" Csub="sdio" Cversion="2.0.0" condition="AT32F415 STDPERIPHERALS CRM">
      <description>SD/SDIO MMC card host interface (SDIO) driver for AT32F415 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_SDIO
        </RTE_Components_h>
        <files>
          <!-- SDIO file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f415_sdio.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/at32f415_sdio.c" attr="config" version="2.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="at32f415_firmware_library" Csub="spi" Cversion="2.0.0" condition="AT32F415 STDPERIPHERALS CRM">
      <description>Serial Peripheral Interface / Inter-IC Sound (SPI) driver for AT32F415 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_SPI
        </RTE_Components_h>
        <files>
          <!-- SPI file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f415_spi.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/at32f415_spi.c" attr="config" version="2.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="at32f415_firmware_library" Csub="tmr" Cversion="2.0.0" condition="AT32F415 STDPERIPHERALS CRM">
      <description>TIMER driver for AT32F415 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_TMR
        </RTE_Components_h>
        <files>
          <!-- TIMER file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f415_tmr.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/at32f415_tmr.c" attr="config" version="2.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="at32f415_firmware_library" Csub="usart" Cversion="2.0.0" condition="AT32F415 STDPERIPHERALS CRM">
      <description>Universal Synchronous Asynchronous Receiver Transmitter (USART) driver for AT32F415 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_USART
        </RTE_Components_h>
        <files>
          <!-- USART file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f415_usart.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/at32f415_usart.c" attr="config" version="2.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="at32f415_firmware_library" Csub="usb" Cversion="2.0.0" condition="AT32F415 STDPERIPHERALS CRM">
      <description>Universal Serial Bus driver for AT32F415 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_USB
        </RTE_Components_h>
        <files>
          <!-- USB file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f415_usb.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/at32f415_usb.c" attr="config" version="2.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="at32f415_firmware_library" Csub="wdt" Cversion="2.0.0" condition="AT32F415 STDPERIPHERALS CRM">
      <description>watchdog timer(WDT) driver for AT32F415 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_WDT
        </RTE_Components_h>
        <files>
          <!-- WDT file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f415_wdt.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/at32f415_wdt.c" attr="config" version="2.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="at32f415_firmware_library" Csub="wwdt" Cversion="2.0.0" condition="AT32F415 STDPERIPHERALS CRM">
      <description>Window Watchdog Timer (WWDT) driver for AT32F415 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_WWDT
        </RTE_Components_h>
        <files>
          <!-- WWDT file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f415_wwdt.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/at32f415_wwdt.c" attr="config" version="2.0.0" />
        </files>
    </component>

    <!-- Utilities AT32F415 -->
    <component Cclass="Device" Cgroup="evb" Csub="at-start-f415" Cversion="2.0.0" condition="AT32F415 STDPERIPHERALS EVB">
      <description>Firmware functions to manage Leds, Keys, COM ports</description>
      <files>
        <!-- include folder -->
        <file category="header" name="Device/Utilities/at32f415_board.h" />
        <!-- evb file -->
        <file category="source" name="Device/Utilities/at32f415_board.c" attr="config" version="2.0.0"/>
      </files>
    </component>

    <!-- Config AT32F415 -->
    <component Cclass="Device" Cgroup="at32f415_conf" Cversion="2.0.0" condition="AT32F415 CMSIS">
      <description>Configuration file</description>
      <files>
        <!-- include folder -->
        <file category="header" name="Device/Include/at32f415_conf.h" attr="config" version="2.0.0"/>
      </files>
    </component>

   <!-- Startup AT32F415  -->
    <component Cclass="Device" Cgroup="Startup"   Cversion="2.0.0" condition="AT32F415">
      <description>System Startup for ArteryTek AT32F415  Devices</description>
      <files>
        <!-- include folder -->
        <file category="include" name="Device/Include/"/>
        <file category="header" name="Device/Include/at32f415.h"/>
        <!-- startup file -->
        <file category="source" name="Device/Source/ARM/startup_at32f415.s" attr="config" version="2.0.0" condition="AT32F415xx ARMCC"/>
        <!-- system file -->
        <file category="source" name="Device/Source/system_at32f415.c"      attr="config" version="2.0.0"/>
      </files>
    </component>
  </components>
</package>
